cf_billing/InformationRegisters/энргПериодыПриемаПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПериодыПриемаПоказаний</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПериодыПриемаПоказаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет схему срез последних.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуСрезПоследних(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуСрезПоследних());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];
	
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация";
		ПараметрыВТ 						= ПараметрыСхемы.ПараметрыВТ;
		Источник 							= ОператорВыбора.Источники[0].Источник;
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Источник.Параметры[1],ПараметрыВТ,ДоступныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуСрезПоследних()
	Текст  = 
	"ВЫБРАТЬ
	|	энргПериодыПриемаПоказанийСрезПоследних.Период КАК Период,
	|	энргПериодыПриемаПоказанийСрезПоследних.Организация КАК Организация,
	|	энргПериодыПриемаПоказанийСрезПоследних.ДатаС КАК ДатаС,
	|	энргПериодыПриемаПоказанийСрезПоследних.ДатаПо КАК ДатаПо
	|ИЗ
	|	РегистрСведений.энргПериодыПриемаПоказаний.СрезПоследних КАК энргПериодыПриемаПоказанийСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
